# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLO11 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 12 # 类别数
scales: # 模型复合缩放比例
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 319 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 319 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 409 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 631 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 631 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# Backbone 主干：MobileViT 提取多层特征
backbone:
  # [from, repeats, module, args]
  - [-1, 1, MobileViTBackbone, [apple/mobilevit-small,True]] #  0: 输出多尺度特征 (C3, C4, C5)
  - [0, 1, SelectIndex, [0,256]] # 1-P3  --输入来自第零层 低层特征，细节多
  - [0, 1, SelectIndex, [1,512]] # 2-P4  --输入来自第零层 中层特征
  - [0, 1, SelectIndex, [2,1024]] # 3-P5  --输入来自第零层 高层特征（语义强）
  - [-1, 2, C3k2, [1024, True]] #4 特征增强
  - [-1, 1, SPPF, [1024, 5]] #5 空间金字塔池化层
  - [-1, 2, C2PSA, [1024]] # 6 PSA 注意力模块 (通道 + 空间)

# PAN-FPN 融合 + CBAM注意力
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #7
  - [[-1, 2], 1, Concat, [1]] # 8
  - [-1, 2, C3k2, [512, False]] # 9

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] #10
  - [[-1, 1], 1, Concat, [1]] # 11
  - [-1, 2, C3k2, [256, False]] # 12

  - [-1, 1, Conv, [256, 3, 2]] #13
  - [[-1, 9], 1, Concat, [1]] # 14
  - [-1, 2, C3k2, [512, False]] # 15

  - [-1, 1, Conv, [512, 3, 2]] #16
  - [[-1, 6], 1, Concat, [1]] # 17
  - [-1, 2, C3k2, [1024, True]] # 18

  - [[12, 15, 18], 1, Detect, [nc]] # Detect(P3, P4, P5)
